impingingJet/basicSetup/0/s
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  plus                                  |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      s;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 0.0;

boundaryField
{
     topSolidWall
     {
        type            fixedValue;
        value           uniform 0.0;
     }
     bottomWall
     {
        type            fixedValue;
        value           uniform 1.0;
     }
     topInlet
     {
	type            fixedValue;
	value           uniform 0.0;
     }
     sideFaces
     {
        type            advective;
	value           $internalField;
     }
}

// ************************************************************************* //
