impingingJet/basicSetup/system/funkySetBoundaryDict
/*--------------------------------*- C++ -*----------------------------------*\
| ========= | |
| \\ / F ield | OpenFOAM: The Open Source CFD Toolbox |
| \\ / O peration | Version: 1.7.1 |
| \\ / A nd | Web: www.OpenFOAM.com |
| \\/ M anipulation | |
\*---------------------------------------------------------------------------*/
FoamFile
{
version 2.0;
format ascii;
class dictionary;
location "system";
object controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


velocities
{
field U;
expressions
(

{
target value;
patchName topInlet;
expression "vector(0,0,(pow(pos().x,2)+pow(pos().y,2)) <= 0.25 ? -1.0 : 0.0 )";
}


);
}
}

